powerlaw_circularcavity3D/Newtonian/Ra1e4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (-1.1 -1.1 -0.1)
    ( 1.1 -1.1 -0.1)
    ( 1.1 1.1 -0.1)
    (-1.1 1.1 -0.1)

    (-1.1 -1.1 1.1)
    ( 1.1 -1.1 1.1)
    ( 1.1 1.1 1.1)
    (-1.1 1.1 1.1)
  
);

blocks
(
     hex (0 1 2 3 4 5 6 7) (44 44 24) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
   
  inlet
     {
      type patch;
      faces
      (
            (0 4 7 3)
            
        );
    }
    
  
    
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
            
        );
    }     
    
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            
        );
    }

    down
    {
        type wall;
        faces
        (  
            (0 1 5 4)
          );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
