powerlaw_circularcavity3D/Newtonian/Ra1e4/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");
      
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   T
   Ux
   Uy
   Uz
);

// sets
// (
//     lBeforex0
//     {
//         type        lineCell;
//         axis        y;

//         start       ( -1e-6 -1e-6 .5);
//         end         ( -1e-6 1.00001 .5 );
        
//     }

//     lAfterx0
//     {
//         type        lineCell;
//         axis        y;

//         start       ( 1e-6 -1e-6 .5);
//         end         ( 1e-6 1.00001 .5 );
        
//     }
// );

